tests/sample_message/VeriifiedPaymentDetails.json

[
    {
        "id": 2071144,
        "order_id": "sp641aa913e2c02",
        "currency": "BDT",
        "amount": "10.0000",
        "payable_amount": "10.0000",
        "discount_amount": "0.0000",
        "disc_percent": 0,
        "recived_amount": null,
        "usd_amt": "0.0000",
        "usd_rate": 0,
        "card_holder_name": null,
        "card_number": null,
        "phone_no": null,
        "bank_trx_id": null,
        "invoice_no": null,
        "bank_status": null,
        "customer_order_id": null,
        "sp_code": "1068",
        "sp_massage": "initiated",
        "sp_message": "initiated",
        "name": "MD. ABDUL KARIM",
        "email": null,
        "address": "dhaka",
        "city": "Dhaka",
        "value1": null,
        "value2": null,
        "value3": null,
        "value4": null,
        "transaction_status": null,
        "method": null,
        "date_time": null
    }
]